{"meta":{"title":"aliang","subtitle":null,"description":"aliang的博客","author":"aliang","url":"http://Hazelnut2002.github.io","root":"/"},"pages":[],"posts":[{"title":"我的一点点个人观点","slug":"我的一点点个人观点","date":"2022-08-29T15:26:42.490Z","updated":"2022-08-29T15:40:15.166Z","comments":true,"path":"2022/08/29/我的一点点个人观点/","link":"","permalink":"http://hazelnut2002.github.io/2022/08/29/%E6%88%91%E7%9A%84%E4%B8%80%E7%82%B9%E7%82%B9%E4%B8%AA%E4%BA%BA%E8%A7%82%E7%82%B9/","excerpt":"","text":"Hi! 我这人没什么文化，文笔不好，写出来东西语无伦次，不过意思应该能读懂。 加了我微信的人也许会发现，以前经常发朋友圈的我，好久没发朋友圈了。 2022年的某一个夏天晚上我睡不着，就翻看了我自己从2013年初注册微信开始的每一条朋友圈，确实，它们记录了我的成长，这些美好回忆真的很棒。我是一个非常爱记录生活的人，我的iCloud存了数万张照片和几千个视频，NAS里也存了几百个G。 但是经过了一段时间的深入思考，我认为，我不需要和那些对我不感兴趣的人，来分享我的生活。就算看到我发的朋友圈，也不会点进去看的。现在加的人越来越多，很多那些人加了不知道干嘛，他们发的朋友圈我大多都跳过不会去看的。 大部分朋友圈里面的人和事其实都和我们没什么关系的，比如说一个很要好的朋友找我求助，我一定会尽我能力来帮忙，但是假如是一个不怎么认识的，他发了朋友圈，求助什么，除了那种生命受到威胁的紧急情况，我实在是不怎么想帮。 我觉得和对我感兴趣的人分享生活是很有意思的，不管他是否与我见过面。所以我现在在筹备自己建一个个人博客，内容我已经在做了，技术支持的话得开学之后找隔壁宿舍的同学帮忙。 我为什么放弃朋友圈而计划做博客呢？因为朋友圈里面的人，不一定都是对我感兴趣的，其实大部分都对我和我的内容没有兴趣。我现在甚至觉得被他们看我在干什么会很不舒服。但是博客网站不一样，关注我、读我文章的人，应该是对我或是我的内容有那么点兴趣的，我会接入评论系统，同时尽可能地解答问题和进行讨论，这样的交流环境就比较有意思了。我的计划是在博客分享一些技术操作、一些产品使用体验、一些我的生活、一些我对影视和音乐的理解以及一些碎碎念。内容不定期更新。 以上仅为我个人观点，如果你的想法不一样，那就以你为准吧，每个人都对不同事物有不同的看法，很多时候都没必要与人争论，改变不了别人看法不说，还可能伤了和气。 我非常喜欢Sister Hazel的《Change Your Mind》，这首歌陪我走过了我最难熬的日子： “If you wanna be somebody else Change your mind, yeah” “如果你想成为别人， 必须要先改变你的思想” 可能我们每个人，都或多或少有过这样的想法：“如果我是她&#x2F;他该有多好啊！” 可是我们会成为她&#x2F;他吗？“如果你想成为别人，必须要先改变思想。”思想能轻易改变吗？不可能。因此，我就是我。不如反璞归真，做回自己。其实活出自己的精彩，每个人都能很优秀。 “Hey, hey Have you ever danced in the rain or thanked the sun Baby, just for shining, just for shining o&#39;er the sea Oh no, you take it all in the world&#39;s a show And yeah, you look much better Look much better when you glow” “可曾试过在雨中舞动身躯， 可曾感谢太阳带来的光明， 可曾感谢大海在阳光照耀下的波光粼粼， 你可知，这样的你看起来也格外迷人” 怀着感恩的心情去面对这世间万物，用心去记录这美好的世界，就会发现这一切都是那么地迷人。 感谢你阅读上面的字。","categories":[],"tags":[]},{"title":"","slug":"hello-world copy","date":"2022-08-28T07:12:23.739Z","updated":"2022-08-28T08:30:26.238Z","comments":true,"path":"2022/08/28/hello-world copy/","link":"","permalink":"http://hazelnut2002.github.io/2022/08/28/hello-world%20copy/","excerpt":"","text":"Testing","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2022-08-28T07:12:23.739Z","updated":"2022-08-28T07:12:23.739Z","comments":true,"path":"2022/08/28/hello-world/","link":"","permalink":"http://hazelnut2002.github.io/2022/08/28/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[]}